{
    "characters": {
        "Anya Sharma": {
            "visual_tags": [
                "female",
                "48 years old",
                "5'7\"",
                "energetic, charismatic presence",
                "sharp, analytical dark eyes",
                "short, stylish salt-and-pepper hair",
                "modern, tailored business attire, often with a unique accessory like a bold necklace or scarf",
                "wears a high-end smartwatch"
            ],
            "required_constraints": [
                "Always thinking 5 years ahead",
                "Never dismisses a 'crazy' idea without exploring its potential",
                "Frequently uses analogies from science fiction or history to explain complex tech concepts"
            ],
            "motion_rules": "Paces when brainstorming; uses expressive hand gestures when presenting. Leans forward with intensity when listening to new ideas.",
            "voice_tone": "Inspiring, articulate, confident; can simplify complex topics effectively. Passionate about innovation.",
            "prop_loadout": [
                "latest smartphone and tablet",
                "digital whiteboard or large sketchpad",
                "collection of tech biographies and future-studies books",
                "high-quality espresso machine in office"
            ],
            "appearance": "A forward-thinking leader who embodies innovation. Looks like she's always just stepped out of a successful keynote on the future of technology.",
            "role": "CTO",
            "catchphrase": "What if we could...? Let's explore the art of the possible."
        },
        "Marcus Thorne": {
            "visual_tags": [
                "male",
                "55 years old",
                "6'0\"",
                "calm, grounded demeanor",
                "thoughtful, deep-set hazel eyes behind rimless glasses",
                "neatly combed graying hair",
                "classic, impeccable suits, always with a tie",
                "prefers an analog high-quality watch"
            ],
            "required_constraints": [
                "Prioritizes stability and scalability in all tech decisions",
                "Always asks 'What's the operational impact and TCO?'",
                "Maintains meticulously organized digital files and notes"
            ],
            "motion_rules": "Still and composed in meetings; tends to listen more than speak, but when he does, it's concise and impactful. Slight, thoughtful nod when agreeing.",
            "voice_tone": "Measured, authoritative, deeply knowledgeable; values clarity and precision. Skeptical of hype.",
            "prop_loadout": [
                "leather briefcase",
                "multiple monitors displaying system architecture diagrams and performance metrics",
                "well-worn copies of seminal software engineering books",
                "a single, high-quality fountain pen for important signatures"
            ],
            "appearance": "The seasoned technologist who ensures the engine room is running smoothly and efficiently. Exudes quiet competence and a deep understanding of complex systems.",
            "role": "CTO",
            "catchphrase": "Let's focus on robust fundamentals before we chase the next shiny object."
        },
        "Sarah Chen": {
            "visual_tags": [
                "female",
                "32 years old",
                "5'5\"",
                "bright, inquisitive expression",
                "trendy glasses",
                "often wears t-shirts from tech conferences or with geeky references",
                "carries a messenger bag with a laptop and various gadgets"
            ],
            "required_constraints": [
                "Has already tried all the troubleshooting steps in the FAQ before calling support",
                "Reads tech blogs and product reviews extensively",
                "Isn't afraid to use developer tools in a browser to diagnose a web issue"
            ],
            "motion_rules": "Animated when describing a problem or a feature request. Taps fingers impatiently if kept on hold or if explanations are too simplistic.",
            "voice_tone": "Clear, direct, knowledgeable about tech terms; expects a similar level of understanding. Can be enthusiastic about good products.",
            "prop_loadout": [
                "latest smartphone",
                "powerful laptop",
                "portable battery pack",
                "notes app filled with feature requests and bug reports for various services"
            ],
            "appearance": "An engaged and informed user who knows her way around technology. Expects products to be intuitive and powerful.",
            "role": "Customer",
            "catchphrase": "I've already cleared my cache and cookies. The issue seems to be on your end."
        },
        "David Miller": {
            "visual_tags": [
                "male",
                "62 years old",
                "5'9\"",
                "slightly bewildered but friendly expression when dealing with tech",
                "reading glasses usually perched on his head or hanging around his neck",
                "comfortable, casual clothing like a polo shirt and khakis",
                "prefers phone calls to chat support"
            ],
            "required_constraints": [
                "Writes down instructions carefully on a notepad",
                "Often prefaces questions with 'This might be a silly question, but...'",
                "Values patience and clear, simple explanations above all else"
            ],
            "motion_rules": "Listens intently, often with a furrowed brow of concentration. Points at the screen when describing what he sees.",
            "voice_tone": "Polite, slightly hesitant when describing technical problems; appreciative of help. Can get flustered if overwhelmed with jargon.",
            "prop_loadout": [
                "older but reliable desktop computer",
                "spiral-bound notebook and a favorite pen",
                "a printed list of passwords (kept 'somewhere safe')",
                "magnifying glass for small print"
            ],
            "appearance": "A kind individual trying his best to navigate an increasingly digital world. Values human connection and straightforward assistance.",
            "role": "Customer",
            "catchphrase": "Could you explain that one more time, but maybe a bit simpler?"
        },
        "Lena Hanson": {
            "visual_tags": [
                "female",
                "41 years old",
                "5'6\"",
                "thoughtful, observant gaze behind rectangular glasses",
                "often wears cardigans or blazers over practical tops",
                "hair usually tied back in a neat bun or ponytail",
                "minimalist jewelry"
            ],
            "required_constraints": [
                "Always grounds insights in established HCI principles and research methodologies",
                "Meticulously documents every observation and user quote",
                "Believes in ethical research practices above all"
            ],
            "motion_rules": "Calm and methodical during user interviews; takes copious notes. Uses precise gestures when explaining findings, often referring to data visualizations.",
            "voice_tone": "Articulate, analytical, empathetic; skilled at asking open-ended questions. Passionate about user advocacy based on evidence.",
            "prop_loadout": [
                "laptop with qualitative analysis software",
                "multiple notebooks for different projects",
                "audio recorder and transcription tools",
                "a well-marked copy of 'The Design of Everyday Things'"
            ],
            "appearance": "A dedicated researcher focused on understanding the 'why' behind user behavior. Looks like she could turn any observation into a compelling research paper.",
            "role": "UX Researcher",
            "catchphrase": "What mental model do users have when approaching this task?"
        },
        "Sam Jordan": {
            "visual_tags": [
                "non-binary",
                "33 years old",
                "5'8\"",
                "sharp, focused eyes that seem to see patterns everywhere",
                "short, edgy haircut",
                "wears comfortable, data-themed t-shirts (e.g., with charts or code snippets) under a zip-up hoodie",
                "fitness tracker displaying lots of personal metrics"
            ],
            "required_constraints": [
                "Always asks 'How can we measure that?'",
                "Believes in A/B testing almost everything",
                "Can create a compelling data visualization for any user behavior"
            ],
            "motion_rules": "Energetic and quick; often pointing at dashboards or analytics screens. Taps fingers rapidly when looking at data streams.",
            "voice_tone": "Fast-paced, enthusiastic about data, peppers speech with statistical terms. Can be very persuasive when backed by numbers.",
            "prop_loadout": [
                "powerful laptop optimized for data analysis (R, Python, SQL)",
                "large monitor for displaying dashboards",
                "collection of survey tools and analytics platform accounts",
                "noise-cancelling headphones for deep focus"
            ],
            "appearance": "A quantitative specialist who lives and breathes data. Looks for statistical significance in every user interaction.",
            "role": "UX Researcher",
            "catchphrase": "The data suggests a significant correlation here. Let's run another test to confirm."
        }
    }
}